# [Link to video.](https://www.youtube.com/watch?v=vuTCz1Gz7tc&list=PLVD25niNi0BkyCc47RgZHKnmIh6nsupN7)

### round()

We can use `round()` to round integers and floats.

```
> round(12.7)
13
> round(-1.1)
-1
> round(53)
53
```

When we have a number that ends in .5, we might expect it to round up for positive numbers and round down for negative numbers, but `round()` picks the even number! This is called [banker's rounding](https://rounding.to/understanding-the-bankers-rounding/), since banks use this kind of rounding to remove bias.

```
> round(-1.5)
-2
> round(0.5)
0
> round(1.5)
2
> round(2.5)
2
> round(5.5)
6
> round(6.5)
6
```

We can specify the number of decimal places as the second argument.

```
> round(3.1415926535, 0)
3
> round(3.1415926535, 1)
3.1
> round(3.1415926535, 2)
3.14
> round(3.1415926535, 3)
3.141
> round(3.1415926535, 4)
3.1416
```

We can round to powers of ten (the nearest 10, 100, 1000 etc) by using a negative integer as the second argument.

```
> round(1337, 0)
1337
> round(1337, -1)
1340
> round(1337, -2)
1300
> round(1337, -3)
1000
```
